# Numpy and Pandas

## Run The Following Code
Hit SHIFT + ENTER when your cusor is inside the cell of code.<br/>

### Pandas

> Data Preparation. Importing pandas

In [1]:
import pandas as pd

> Open up a CSV file

In [3]:
hdb = 'week 9 data/0. Raw Data/sample/years/hdb_resale_sample_raw_2012.csv'

df = pd.read_csv(hdb)

> viewing the contents of the dataset

The main dataset that we will work on is on HDB resale data.<br/>
See the description below for the fields given. <br/>
<br/>
<table>
    <tr><th>Field</th><th>Description</th></tr>
    <tr><td>Trans_YearMonth</td><td>year-month (YYYY-MM) for transaction</td></tr>
    <tr><td>town</td><td>town for the resale flat</td></tr>
    <tr><td>flat_type</td><td>flat type for the resale flat</td></tr>
    <tr><td>block</td><td>block for the resale flat</td></tr>
    <tr><td>street_name</td><td>street for the resale flat</td></tr>
    <tr><td>storey_range</td><td>storey range for the resale flat</td></tr>
    <tr><td>floor_area_sqm</td><td>floor area in square meter</td></tr>
    <tr><td>flat_model</td><td>model of resale flat</td></tr>
    <tr><td>lease_commence_date</td><td>year of lease commencement</td></tr>
    <tr><td>resale_price</td><td>price of the resale flat</td></tr>
</table>

In [7]:
df.shape

(1950, 9)

In [8]:
df.head() #first 5 rows of data

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000

> Concatenating DataFrames

In [9]:
import os

In [10]:
os.listdir() #prints out current working directory

['.ipynb_checkpoints',
 'bak',
 'DC Bootcamp Week 9.pdf',
 'DC Bootcamp Week 9.pptx',
 'DC_Bootcamp_Week_9.ipynb',
 'DC_Bootcamp_Week_9_answers.ipynb',
 'week 9 data',
 'Week_09-20210610T091707Z-001.zip',
 '~$DC Bootcamp Week 9.pptx']

In [11]:
os.listdir('week 9 data/0. Raw Data/sample/years') #prints out files in specific path

['hdb_resale_sample_raw_2012.csv',
 'hdb_resale_sample_raw_2013.csv',
 'hdb_resale_sample_raw_2014.csv',
 'hdb_resale_sample_raw_2015.csv',
 'hdb_resale_sample_raw_2016.csv',
 'hdb_resale_sample_raw_2017.csv',
 'hdb_resale_sample_raw_2018.csv',
 'hdb_resale_sample_raw_2019.csv',
 'hdb_resale_sample_raw_2020.csv',
 'hdb_resale_sample_raw_2021.csv']

In [15]:
for i in files:
    print(i)

hdb_resale_sample_raw_2012.csv
hdb_resale_sample_raw_2013.csv
hdb_resale_sample_raw_2014.csv
hdb_resale_sample_raw_2015.csv
hdb_resale_sample_raw_2016.csv
hdb_resale_sample_raw_2017.csv
hdb_resale_sample_raw_2018.csv
hdb_resale_sample_raw_2019.csv
hdb_resale_sample_raw_2020.csv
hdb_resale_sample_raw_2021.csv

In [70]:
path = 'week 9 data/0. Raw Data/sample/years'
files = os.listdir(path)

dfs = []
for i in files: #loop through the files and save 
    
    df = pd.read_csv(path+'/'+i)
    
    print(i, ':', df.shape)
    dfs.append(df)

hdb_resale_sample_raw_2012.csv : (1950, 9)
hdb_resale_sample_raw_2013.csv : (1491, 9)
hdb_resale_sample_raw_2014.csv : (1320, 9)
hdb_resale_sample_raw_2015.csv : (1562, 9)
hdb_resale_sample_raw_2016.csv : (1523, 9)
hdb_resale_sample_raw_2017.csv : (1641, 9)
hdb_resale_sample_raw_2018.csv : (1631, 9)
hdb_resale_sample_raw_2019.csv : (1654, 9)
hdb_resale_sample_raw_2020.csv : (1610, 9)
hdb_resale_sample_raw_2021.csv : (618, 9)

In [17]:
type(dfs)

list

In [16]:
len(dfs)

10

In [71]:
concatdf = pd.concat(dfs) #concatenate dataframes

In [72]:
concatdf.shape

(15000, 9)

In [30]:
concatdf #notice the index is off because it follows respective dataframes index

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0
...,...,...,...,...,...,...,...,...,...
613,2021-04,5 ROOM,230,LOR 8 TOA PAYOH,01 TO 03,119.0,Standard,1976,430000.0
614,2021-04,5 ROOM,229,LOR 8 TOA PAYOH,10 TO 12,117.0,Standard,1976,510000.0
615,2021-04,3 ROOM,6,MARSILING DR,01 TO 03,65.0,Improved,1976,268000.0
616,2021-04,3 ROOM,13,MARSILING LANE,07 TO 09,76.0,Improved,1976,240000.0
617,2021-04,4 ROOM,8,MARSILING DR,01 TO 03,88.0,Improved,1976,295000.0

In [31]:
concatdf = concatdf.reset_index(drop=True) #reset index, drop=True will drop current index otherwise, it will appear as new field

In [32]:
concatdf

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0
...,...,...,...,...,...,...,...,...,...
14995,2021-04,5 ROOM,230,LOR 8 TOA PAYOH,01 TO 03,119.0,Standard,1976,430000.0
14996,2021-04,5 ROOM,229,LOR 8 TOA PAYOH,10 TO 12,117.0,Standard,1976,510000.0
14997,2021-04,3 ROOM,6,MARSILING DR,01 TO 03,65.0,Improved,1976,268000.0
14998,2021-04,3 ROOM,13,MARSILING LANE,07 TO 09,76.0,Improved,1976,240000.0
14999,2021-04,4 ROOM,8,MARSILING DR,01 TO 03,88.0,Improved,1976,295000.0

> Joining DataFrames

In [33]:
towns = pd.read_csv('week 9 data/0. Raw Data/sample/hdb_resale_sample_raw_towns.csv') #towns dataframe

In [34]:
towns.head()

          town      street_name
0  JURONG EAST    TEBAN GDNS RD
1      GEYLANG         BALAM RD
2   QUEENSTOWN      C'WEALTH CL
3   QUEENSTOWN      C'WEALTH DR
4    TOA PAYOH  LOR 1 TOA PAYOH

In [73]:
joineddf = pd.merge(concatdf, towns, how='left', on='street_name') #joined dataframe

In [74]:
joineddf.shape

(15000, 10)

In [39]:
joineddf.head()

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,town
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0,GEYLANG
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0,GEYLANG
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0,GEYLANG
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0,GEYLANG
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0,GEYLANG

In [41]:
joineddf.columns

Index(['Tranc_YearMonth', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       'town'],
      dtype='object')

In [ ]:
joineddf = joineddf[['Tranc_YearMonth', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date', 'resale_price',
       ]]

> Applying Function

In [42]:
import numpy as np

In [ ]:
np.sum()
np.sqrt()
np.mean()

In [44]:
joineddf.apply(np.dtype) #default axis=0, applying function to all columns

Tranc_YearMonth         object
flat_type               object
block                   object
street_name             object
storey_range            object
floor_area_sqm         float64
flat_model              object
lease_commence_date      int64
resale_price           float64
town                    object
dtype: object

In [45]:
joineddf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15000 entries, 0 to 14999
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Tranc_YearMonth      15000 non-null  object
 1   flat_type            15000 non-null  object
 2   block                15000 non-null  object
 3   street_name          15000 non-null  object
 4   storey_range         15000 non-null  object
 5   floor_area_sqm       15000 non-null  float64
 6   flat_model           15000 non-null  object
 7   lease_commence_date  15000 non-null  int64
 8   resale_price         15000 non-null  float64
 9   town                 14429 non-null  object
dtypes: float64(2), int64(1), object(7)
memory usage: 1.3+ MB

In [46]:
joineddf.head(5)

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,town
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0,GEYLANG
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0,GEYLANG
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0,GEYLANG
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0,GEYLANG
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0,GEYLANG

In [47]:
a = "3 ROOM"
b = "Standard"

a + " " + b

'3 ROOM Standard'

In [48]:
#Function for row data
def getHDBFullType(row):
    return row['flat_type'] + ' ' + row['flat_model']

In [49]:
joineddf.apply(getHDBFullType, axis=1) #applying function to all rows

0        3 ROOM Standard
1        3 ROOM Standard
2        3 ROOM Standard
3        3 ROOM Standard
4        3 ROOM Standard
              ...
14995    5 ROOM Standard
14996    5 ROOM Standard
14997    3 ROOM Improved
14998    3 ROOM Improved
14999    4 ROOM Improved
Length: 15000, dtype: object

In [75]:
joineddf['full_flat_type'] = joineddf.apply(getHDBFullType, axis=1) #assign as new column

In [51]:
joineddf

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,town,full_flat_type
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0,GEYLANG,3 ROOM Standard
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0,GEYLANG,3 ROOM Standard
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0,GEYLANG,3 ROOM Standard
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0,GEYLANG,3 ROOM Standard
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0,GEYLANG,3 ROOM Standard
...,...,...,...,...,...,...,...,...,...,...,...
14995,2021-04,5 ROOM,230,LOR 8 TOA PAYOH,01 TO 03,119.0,Standard,1976,430000.0,TOA PAYOH,5 ROOM Standard
14996,2021-04,5 ROOM,229,LOR 8 TOA PAYOH,10 TO 12,117.0,Standard,1976,510000.0,TOA PAYOH,5 ROOM Standard
14997,2021-04,3 ROOM,6,MARSILING DR,01 TO 03,65.0,Improved,1976,268000.0,WOODLANDS,3 ROOM Improved
14998,2021-04,3 ROOM,13,MARSILING LANE,07 TO 09,76.0,Improved,1976,240000.0,WOODLANDS,3 ROOM Improved
14999,2021-04,4 ROOM,8,MARSILING DR,01 TO 03,88.0,Improved,1976,295000.0,WOODLANDS,4 ROOM Improved

In [54]:
mystring = '2021-10'
print(mystring.split('-')[0])
print(mystring.split('-')[1])

2021
10

In [76]:
#Splitting year month
def getYear(YearMonth): 
    return YearMonth.split('-')[0]

def getMonth(YearMonth):
    return YearMonth.split('-')[1]

In [85]:
joineddf['Year'] = joineddf['Tranc_YearMonth'].apply(getYear) # assign as new column

In [84]:
joineddf['Month'] = joineddf['Tranc_YearMonth'].apply(getMonth)

In [86]:
joineddf.head()

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,town,full_flat_type,Year,Month
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0,GEYLANG,3 ROOM Standard,2012,03
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0,GEYLANG,3 ROOM Standard,2012,03
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0,GEYLANG,3 ROOM Standard,2012,03
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0,GEYLANG,3 ROOM Standard,2012,03
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0,GEYLANG,3 ROOM Standard,2012,03

In [ ]:
OUTPUT = 'week 9 data/1. Processed Data/hdb_resale_sample_processed.csv'

joineddf.to_csv(OUTPUT, index=False)

In [60]:
joineddf

,Tranc_YearMonth,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,town,full_flat_type,Year,Month
0,2012-03,3 ROOM,21,BALAM RD,01 TO 05,60.0,Standard,1967,276500.0,GEYLANG,3 ROOM Standard,2021,01
1,2012-03,3 ROOM,19,BALAM RD,06 TO 10,60.3,Standard,1967,285000.0,GEYLANG,3 ROOM Standard,2021,01
2,2012-03,3 ROOM,23,BALAM RD,01 TO 05,60.3,Standard,1967,290000.0,GEYLANG,3 ROOM Standard,2021,01
3,2012-03,3 ROOM,19,BALAM RD,01 TO 05,60.3,Standard,1967,295000.0,GEYLANG,3 ROOM Standard,2021,01
4,2012-03,3 ROOM,20,BALAM RD,01 TO 05,60.3,Standard,1967,299000.0,GEYLANG,3 ROOM Standard,2021,01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
14995,2021-04,5 ROOM,230,LOR 8 TOA PAYOH,01 TO 03,119.0,Standard,1976,430000.0,TOA PAYOH,5 ROOM Standard,NaN,NaN
14996,2021-04,5 ROOM,229,LOR 8 TOA PAYOH,10 TO 12,117.0,Standard,1976,510000.0,TOA PAYOH,5 ROOM Standard,NaN,NaN
14997,2021-04,3 ROOM,6,MARSILING DR,01 TO 03,65.0,Improved,1976,268000.0,WOODLANDS,3 ROOM Improved,NaN,NaN
14998,2021-04,3 ROOM,13,MARSILING LANE,07 TO 09,76.0,Improved,1976,240000.0,WOODLANDS,3 ROOM Improved,NaN,NaN
14999,2021-04,4 ROOM,8,MARSILING DR,01 TO 03,88.0,Improved,1976,295000.0,WOODLANDS,4 ROOM Improved,NaN,NaN

In [61]:
groupby_obj = joineddf.groupby(['Year', 'town'])['resale_price']

In [69]:
groupby_obj.sum().reset_index()

    Year             town  resale_price
0   2021       ANG MO KIO     3396800.0
1   2021           BISHAN      943000.0
2   2021      BUKIT MERAH    40850576.0
3   2021      BUKIT TIMAH     1908000.0
4   2021     CENTRAL AREA     2351776.0
5   2021          GEYLANG    21087576.0
6   2021          HOUGANG     3295000.0
7   2021      JURONG WEST    11359000.0
8   2021  KALLANG/WHAMPOA    26719300.0
9   2021    MARINE PARADE    16619800.0
10  2021       QUEENSTOWN    43081676.0
11  2021        TOA PAYOH    44482728.0
12  2021        WOODLANDS     4364500.0

In [66]:
groupby_obj.sort_va

44482728.0

# !! Your Turn !!

## Replace the code marked as <..> COMPLETELY with your own.
For example:
length = <..> will be replaced by length = 10

# Question 1 
1) Using OS, list out the list of files in week 9 data > 0. Raw Data > full > flat-types <br/>
2) Read them as separate dataframes and save them in a list named <b>hdbYearDFs</b>

In [ ]:
os.<..>

In [ ]:
path = <..>
files = os.<..>
hdbYearDFs = []
for <..>:
    <..>

# Question 2 
1) Concat the list of dataframes in <b>hebYearDFs</b> and save the final dataframe as <b>hdbdf</b> <br/>
2) Reset <b>hdbdf</b> index and drop the old index. <br/>
3) Print the last 10 rows of <b>hdbdf</b>

In [ ]:
hdbdf = <..>

# Question 3
1) Create 2 new columns <b>Tranc_Year</b> and <b>Tranc_Month</b> using getYear and getMonth functions <br/>
2) Create a new function <b>getMidStorey</b> that takes in the <b>storey_range</b> of the resale flat and returns the mid storey (round to nearest integer) <br/>
3) Create a new column <b>mid_storey</b> using the <b>getMidStorey</b>

In [ ]:
hdbdf['Tranc_Year'] = hdbdf['Tranc_YearMonth'].<..>
hdbdf['Tranc_Month'] = hdbdf['Tranc_YearMonth'].<..>

In [ ]:
def getMidStorey(storey_range):
    <..>

In [ ]:
hdbdf['mid_storey'] = <..>

# Question 4 
1) Create a new column <b>full_flat_type</b> using getHDBFullType function <br/>
2) Create a new function <b>getAddress</b> that takes in the a row and returns the address <br/>
<b>Sample Output: 7, TELOK BLANGAH CRES</b> <br/>
3) Create a new column <b>address</b> using the <b>getAddress</b>

In [ ]:
<..>

# Question 5

1) Create a new column **floor_area_sqft**, to store the floor area in squared feet

    1 squared meter = 10.764 squared foot

In [ ]:
<..>

2) Create a new column **price_per_sqft**, which is the price per squared foot of the particular resale unit

In [ ]:
<..>

3) Create a new column **hdb_age**, which is calculated based on current year minus the **lease_commence_date**

In [ ]:
<..>

# Question 6 
1) Read <b>hdb_resale_full_raw_address.csv</b> into dataframe and name it <b>addressdf</b> <br/>
2) Print out the top 5 rows and find a common column with <b>hdbdf</b> <br/>
3) Join the 2 dataFrames (left: hdbdf, right:addressdf) together using left join and name the final dataframe <b>hdbaddressdf</b>

In [ ]:
addressdf = pd.read_csv(<..>)

In [ ]:
addressdf.<..>

In [ ]:
hdbaddressdf = pd.merge(<..>)

# Question 7*

1) Calculate the a column **percentage_difference_from_average**, which is the percentage difference of the unit's resale price over the average resale price of the same flat_type in the same town. </br>

For example, the average for "3 ROOM" flat type in ANG MO KIO is \\$324,380. </br>
For a particular HDB unit with resale price of $410,000, the percentage difference is .264, which means this particular unit is 26.4% more expensive than the average resale price of the same flat_type in the same town.

> Note:
> - Do no need to round up the average resale price (of flat_type in each town). Use the numbers (decimal points) as you calculated </br>
> - You may need to use **groupby** method to calculate the average resale price for flat_type in each town. Do rename the column name into something meaningful, for example **avg_price_by_town_flattype**
> - You may need to use **"merge"** method to join two tables or **"apply"** a function to add a new column before calculating the percentage difference
> - If you have created any temporary column(s) in the **fullhdbdf**, remove the column(s)

In [ ]:
<..>

# Question 8 
1) Save the fullhdbdf in Processed Data folder as <b>hdb_resale_full_processed.csv</b> <br/>

In [ ]:
<..>